//
//  NewWordEnum.swift
//  NewlyCoinedWord
//
//  Created by 이상남 on 2023/07/26.
//

import Foundation

enum NewWords: String,CaseIterable {
case 갑분싸 =  "갑자기 분위기 싸하다."
case 갑통알 = "갑자기 통장을 보니 알바 해야겠다"
case 구취 = "구독 취소"
case 남아공 = "남아서 공부나 해라"
case 만반잘부 = "만나서 반가워 잘 부탁해"
case 분조카 = "분위기 좋은 카페"
case 불소 = "불타는 소통"
case 애빼시 = "애교 빼면 시체"
case 오운완 = "오늘 운동 완료"
case 점메추 =  "점심 메뉴 추천"
case 저메추 = "저녁 메뉴 추천"
case 주불 = "주소 불러  의 줄임말"
case 스불재 = "스스로 불러온 재앙 의 줄임말"
case 내또출 = "내일 또 출근"
case 삼귀다 = "사귀다의 사를 삼으로 바꾼 말로, 사귀기전의 썸을 타는 단계를 뜻하는 말"
case 나심비 = "가심비의 가를 나로 바꿔 나(본인)의 심리를 만족시킨다는 뜻"
case 오저치고 = "오늘 저녁 치킨 고? 의 줄임말"
case 쉽살재빙 = "쉽게 살면 재미없어 빙고 의 줄임말"
case 꾸안꾸 = "꾸미지 않은듯 꾸민듯 하다를 뜻함"
case 좋댓구알 = "좋아요 댓글 구독 알림설정  의 줄임말"
case 복세편살 = "복잡한 세상 편하게 살자 의 줄임말"
case 억텐 = "억지 텐션 의 줄임말"
case 슬세권 = "역세권의 변형어로 역을 슬리퍼의 슬로 바꿔 슬리퍼를 신고 돌아다닐수 있는 곳을 뜻함"
case 스세권 = "슬세권처럼 역세권의 변형어로 역을 스타벅스의 스로 바꿘 스타벅스 세권의 합성어"
case 맥세권 = "스세권과 마찬가지로 맥도날드와 세권의 합성어, 이외에도 파세권(파리바게트), 등 좋아하는 브랜드의 앞글자와 세권을 합친 합성어가 많음"
case 스라밸 = "일과 삶의 균형을 뜻하는 워라밸의 변형된 말로 스터디(Study)+라이프(Life)+밸런스(Balance)합성어"
case 고스팅 = "Gost(유령) 와 ing의 합성어 ( 유령처럼 잠수타서 안보이는 사람을 뜻함 )"
case 제당슈만 = "제가 당신을 슈퍼스타로 만들어드리겠습니다  의 줄임말"
case 군싹 = "군침이 싹도네(싹돈다) 라는 뜻"
case 편리미엄 = "편리함이 프리미엄이다라는 뜻으로 가격보다는 편리한게 중요하다는 말"
case 미스 = "추리 미스터리 스릴러 의 줄임말"
case H워얼V = "( 글자를 뒤집어 보면 사랑해가 된다.)"
case 팬아저 =  "팬은 아니지만 저장 한다는 뜻"
case 롬곡옾높 =  "(뒤집어 보면 폭풍눈물 이 된다 )"
case 좋못사 = "좋아하다 못해 사랑한다 의 줄임말"
case 알잘딱깐센 = "알아서 잘 딱 깔끔하고 센스있게 의 줄임말"
case 자만추 = "자연스러운 만남 추구 의 줄임말"
case 스좀비 = "스마트폰과 좀비의 합성어로 스마트폰만 보며 앞도 제대로 안보고 좀비처럼 걷는 사람들을 뜻함"
}
